MicroEJ/Example-Standalone-Java-C-Interface/STM32F429IDISCO-SNI_SP_FreeRTOS-CM4_ARMCC-bsp/Libraries/CMSIS/Device/ST/STM32F4xx/Source/Templates/system_stm32f4xxold.c
#ifdef SDRAM_MEM_SWAP
  /* Swap FMC SDRAM banks and NAND2/PCCARD banks for code execution */
  SYSCFG->MEMRMP = (uint32_t)0x400; 
#endif /* SDRAM_MEM_SWAP */ 


/*
  Bank1_SDRAM is configured as follow:

  FMC_SDRAMTimingInitStructure.FMC_LoadToActiveDelay = 2;      
  FMC_SDRAMTimingInitStructure.FMC_ExitSelfRefreshDelay = 12;  
  FMC_SDRAMTimingInitStructure.FMC_SelfRefreshTime = 8;        
  FMC_SDRAMTimingInitStructure.FMC_RowCycleDelay = 12;         
  FMC_SDRAMTimingInitStructure.FMC_WriteRecoveryTime = 3;      
  FMC_SDRAMTimingInitStructure.FMC_RPDelay = 4;                
  FMC_SDRAMTimingInitStructure.FMC_RCDDelay = 4;               

  FMC_SDRAMInitStructure.FMC_Bank = SDRAM_BANK;
  FMC_SDRAMInitStructure.FMC_ColumnBitsNumber = FMC_ColumnBits_Number_8b;
  FMC_SDRAMInitStructure.FMC_RowBitsNumber = FMC_RowBits_Number_11b;
  FMC_SDRAMInitStructure.FMC_SDMemoryDataWidth = FMC_SDMemory_Width_16b;
  FMC_SDRAMInitStructure.FMC_InternalBankNumber = FMC_InternalBank_Number_4;
  FMC_SDRAMInitStructure.FMC_CASLatency = FMC_CAS_Latency_3; 
  FMC_SDRAMInitStructure.FMC_WriteProtection = FMC_Write_Protection_enable;
  FMC_SDRAMInitStructure.FMC_SDClockPeriod = FMC_SDClock_Period_2;
  FMC_SDRAMInitStructure.FMC_ReadBurst = FMC_Read_Burst_disable;
  FMC_SDRAMInitStructure.FMC_ReadPipeDelay = FMC_ReadPipe_Delay_1;
  FMC_SDRAMInitStructure.FMC_SDRAMTimingStruct = &FMC_SDRAMTimingInitStructure;
*/
  
}
#endif /* DATA_IN_ExtSDRAM */


/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */    
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
